import numpy

x = numpy.array([[1, 2, 3, 4],
                 [5, 6, 7, 8],
                 [9, 10, 11, 12],
                 [13, 14, 15, 16]])
# 请给出以下运行的结果
# 1.y = x[:, 2];
y = x[:, 2]
print(y)  # 3 7 11 15
# 2.y = x[-1,:2];
y = x[-1, :2]
print(y)  # 13,14
# 3. y = x[:, [True, False, False, True]];
y = x[:, [True, False, False, True]]
print(y)  # [[ 1  4][ 5  8][ 9 12] [13 16]]
# # 4.y = x[0:2, 0:2];
y = x[0:2, 0:2]
print(y)  # [[1 2][5 6]]
# # 5.y = x[[0, 1, 2], [0, 1, 2]];
y = x[[0, 1, 2], [0, 1, 2]]
print(y)  # [1, 6, 11]
# # 6. y = x[0]**2;
y = x[0] ** 2
print(y)  # [1, 4, 9 ,16]
# # 7.y = x.max(axis=1);
y = x.max(axis=1)
print(y)  # [4, 8, 12, 16]
# # 8. y = x[:2, :2]+x[:2,2:];
y = x[:2, :2] + x[:2, 2:]
print(y)  # [[4 6] [12 14]]
# # 9.y = x[:2, :3].T;
y = x[:2, :3].T
print(y)  # [[1 5] [2 6] [3 7]]
# # 10.y = x[:2, :3].reshape((3, 2));
y = x[:2, :3].reshape((3, 2))
print(y)  # [[1 2][3 5] [6 7]]
